9/data/attachments/e9f6da5a8408c877.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_55dab93f-d953-4d3c-b263-393af3026043</nif:username>
            <nif:friendToBeAdded>Nathan_usually_Actions_50457_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>